#List of suffix - oblique form rules.pdf, Bhavvachaknaam pratay, krudantache prakar and  kary pratay, shabdyogi avyache prakar pratay, vibhakti pratirupe avyav
suffixtuple = ("ातून",'यांना','मध्ये','स', 'ला', "ते", "ने", "ए", "शी", "ून","ऊन", "हून", "चा", "ची", "चे", "त", "ई", "ना", "नी", "ही", "च्या", "नो","प्रत", "लागी", "कडून", "करवी", "द्वारा", "मुळे", "योगे", "प्रमाणे", "सह", "बरोबर", "वतीने", "करीता", "साठी", "कडे", "प्रीत्यर्थ", "बद्दल", "प्रति", "स्तव", "पासून", "पेक्षा", "शिवाय", "खेरीज", "वाचून", "संबंधी", "विषयी", "आत", "खाली", "ठायी", "समोर", "भोवती", "पूर्वी", "पुढे", "आधी", "नंतर", "पर्यंत", "पावेतो", "खालून", "मधून", "बाहेर", "मागे", "पलीकडे", "जवळ", "पाशी", "नजीक", "समीप", "समक्ष", "करून", "हाती", "कारणे", "करिता", "अर्थी", "निमित्त", "विना", "व्यतिरिक्त", "परता", "तर", "तम", "परीस", "योग्य", "सारखा", "जोगा", "सम", "समान", "बरहुकूम", "मात्र", "सुद्धा", "देखील", "च", "पण", "विशी", "संगे", "सकट", "सहित", "सवे", "समवेत", "पैकी", "पोटी", "ऐवजी", "जागी", "बदली", "विरुद्ध", "विण", "उलटे", "उलट", "भर", "ली", "वे", "की", "गिरी", "त्व", "पणा", "वा","ून",'ाई','णे','ामध्ये' 'ाकडे', 'णारे' 'ांची', 'ेल्या', 'ांहून', '्याचे', 'ाचेच', 'ातून', 'ाविषयी', 'ींना', 'ातच',
    'ींचा', 'ामधून', 'ासाठी' 'ामुळे', 'ेला', 'ाकडून',"निशी"
    'लेला', '्यासारखी', 'ीसारखी', '्यासारखे', '्यासारखा', 'लेली', 'ेल्यांची', 'ेतर्फे', 'ामध्ये', 'ांमध्ये', 'ेबद्दल',
    'ेसंबंधी', 'ॉकमध्ये', 'ेमध्ये',"बद्द्ल","ता",
    'ांतर्फे', 'ेमार्फत', 'ांकडून', 'च', 'ाशिवाय', 'ांबरोबर', 'ेकडून', 'ांकडे',

    'ींनी', 'ामध्ये', 'ासंबंधी', 'ाशी', 'ींपुढे', 'ांसंबंधीची', 'ाच', 'ींचे', 'ांखाली',
    'ीवर', 'णाऱ्या', 'ातसुद्धा', 'ाचा', 'ितेच्या', 'णारे', 'ांची', 'ेल्या', 'ांहून', '्याचे', 'ाचेच', 'ांबरोबरच',
    'ींना', 'ातच', 'ींचा', 'ेमधून', 'ांसाठी', 'ींमुळे', 'ेला', 'ींमुळेच', 'ीची', 'ीहून', 'ासारखी', 'ीत', 'ाय',
    'ातली', 'ावरून', 'ीही', 'ाचे', 'ीदेखील', 'ीसुद्धा', 'ीसाठी', 'ीनंतर', 'ाच्या', 'ांचा', 'तील', 'ातीलच',
    'ाचं', 'ून', 'ाएवढीच', 'ींची', 'ांवरून', 'ांचीच', 'ेली', 'ीचे',
    'ीतच', 'ांमध्ये', '्या', 'ीचं', 'ीचा', 'ाबाबत', 'ाची', 'ापेक्षा', 'ाखाली', 'ाबरोबर', 'तात', 'ेलो', 'ीलाही', 'ातही',
    'ीला', 'ापासून', 'ींवर', '्याने', 'ींतील', 'ासंबंधातील', 'ाद्वारे', 'ींतून', 'ींपासून',
    'ानुसार', 'ांतर्गत', 'ेलं', 'ांच्या', 'ानंतर', 'ामधे', 'ाला', 'ेल्यांना', 'ींबद्दल', 'ींच्या', 'ेत', '्यावर',
    'ींबाबत',"आई","ताना",
    'ांपासून', '्याची', 'ीमुळे', 'लेल्या', 'ाखालील', 'ीच्या', 'ेल्यांचा', 'ामुळे', 'ांपेक्षा', 'ांचे', 'ावर', 'लात',
    'ांनी', 'ीचेच',
    'ातला', '्यामुळे', 'ातील', 'ांवर', 'ांबद्दल', 'ातल्या', 'ीचीच', 'ीतून', 'ल्याने', 'ींकडे', 'ेले', '्यासारखं',
 'ला', 'िंग', 'िंगसंबंधी', 'ॉकहून', 'ेवरच', 'िंगचे', 'ांमधून', 'ींग', 'ेचं', 'ेचा', 'ेनं', 'ेच्या', 'ेपाशी',
     'ांनाही', 'िंगशी', 'ेकडे', 'ांप्रमाणे', 'ेतील', 'ांना', 'ात', 'ेवरही', 'ांमधील',
    'ेसारख्या', 'ांतून', 'ांमार्फत', 'ेतलं', 'ा', 'ेसमोरच', 'िंगची', 'िंगमधील', 'ांचा', 'ेकडील', 'िंगच्या', 'ेतच', 'ेत',
    'ेनेही', 'ेसाठी', 'ेकडूनही', 'ांमधली', 'ांचाही', 'ांत', 'ांशी', 'ांसाठी', 'िंगमध्ये', 'ेची', '्स', 'ेशिवाय',
    'िंगपर्यंत',
    'ांच्या', 'ामधील', 'ांशिवाय', 'ांतील', 'ांपैकी', 'ेवरील', 'ेबरोबर',
    'ेस', 'ांवर', 'ांचे', 'ांनी', 'ेतल्या', 'ेतली', 'िंगपासून', 'ांची', 'ावर', 'ेतून', 'ेजवळील', 'ेवर',
    'ेऐवजी', 'ेशी', 'ेने', 'ांपेक्षा', 'ेतही', 'ांनीही',"पावतो"
)

#List of exceptions available in Oblique form rules.pdf
Exceptions = ['आजोबा', 'दादा', 'काका', 'मामा', 'चहा', 'हत्ती', 'नंदी', 'कोबी', 'कवी', 'मुनी', 'ऋषी', 'पेरू', 'चाकू', 'खडू', 'शत्रू', 'खेळाडू', 'पशू', 'गुरु', 'साधू', 'देवी', 'दासी', 'मूर्ती', 'काकू', 'वधू', 'वस्तू']

#List of Surnames avaialble in Oblique form rules.pdf
Surname = {
    "देशपांड्यांना" : "देशपांडे",
    "देशपांडे":"देशपांडे",
      "कोल्ह्यांना" : "कोल्हे",
      "कोल्हे":"कोल्हे",
      "आठवल्यांना" : "आठवले",
      "आठवले":"आठवले",
      "पालव्यांना" : "पालवे",
      "पालवे":"पालवे",
      "खेरांना" : "खेर",
      "खेर":"खेर",
      "केळकरांना" : "केळकर",
      "केळकर":"केळकर",
      "गायकवाडांना" : "गायकवाड",
      "गायकवाड":"गायकवाड",
      "भटांना" : "भट",
      "भट":"भट",
      "साधूंना" : "साधू",
      "साधू":"साधू",
      "कडूंना" : "कडू",
      "कडू":"कडू",
      "बोरांना" : "बोरा", 
      "बोरा":"बोरा",
      "कटारियांना" : "कटारिया",
      "कटारिया":"कटारिया",
      "घवींना" : "घवी",
      "घवी":"घवी", 
      "वाणींना" : "वाणी",
      "वाणी":"वाणी" 
}
#List of Gramnaam available in Oblique form rules.pdf
Gramnam = {
      "कोलकात्याला" : "कोलकाता",
      "कोलकाता":"कोलकाता",
      "बडोद्याला" : "बडोदा",
      "बडोदा":"बडोदा",
      "दिल्लीला" : "दिल्ली",
      "दिल्ली":"दिल्ली",
      "मुंबईला" : "मुंबई",
      "मुंबई":"मुंबई",
      "पुण्याला" : "पुणे",
      "पुणे":"पुणे",
      "पेडण्याला" : "पेडणे",
      "पेडणे":"पेडणे",
      "नागपूरला" : "नागपूर",
      "नागपूर":"नागपूर",
      "नागपुरात" : "नागपूर",
      "सोलापुरात" : "सोलापूर",
      "सोलापूरला" : "सोलापूर",
      "सोलापूर": "सोलापूर"
}
