############################################################################################
turki_word = ['कालगी', 'बंदूक', 'कजाग']
english_word = ['टी. व्ही.', 'डॉक्टर', 'कोर्ट', 'पेन', 'पार्सल', 'सायकल', 'स्टेशन', 'हॉस्पिटल', 'बस', 'फाईल', 'रेल्वे',
                'पास', 'ब्रेक', 'कप', 'मास्तर', 'फी',
                'बॉल', 'स्टॉप', 'ऑफिस', 'एजंट', 'टेलिफोन', 'सिनेमा', 'सर्कस', 'पॅन्ट', 'बॅट', 'पोस्ट', 'तिकीट',
                'ड्राइव्हर', 'मोटर', 'कंडक्टर', 'नंबर',
                'टीचर', 'सर', 'मॅडम', 'पेपर', 'नर्स', 'पेशंट', 'इंजेक्शन', 'बटन', 'ड्रेस', 'ग्लास', 'इत्यादी']
portuges_word = ['बटाटा', 'पगार', 'बिजागरी', 'कोबी', 'हापूस', 'फणस', 'घमेले', 'पायरी', 'लोणचे', 'मेज', 'चावी', 'तुरुंग',
                 'तिजोरी', 'काडतुस', '']
farshi_word = ['रवाना', 'समान ', 'हकीकत', 'अत्तर', 'अऱ्बु', 'पेशवा', 'पोशाख', 'सौदागार', 'कामगार', 'गुन्हेगार',
               'फडणवीस', 'बाम', 'लेजीम', 'शाई', 'गरीब',
               'खानेसुमारी', 'हजार', 'शाहीर', 'मोहोर', 'सरकार', 'महिना', 'हप्ता']
arbi_word = ['अर्ज', 'इनाम', 'हुकूम', 'मेहनत', 'जाहीर', 'मंजूर', 'शाहीर', 'साहेब', 'मालक', 'मौताज', 'नक्कल', 'जबाब',
             'उर्फ', 'पैज', 'मजबूत', 'शहर', 'नजर',
             'मनोरा', 'खर्च', 'वाद', 'मदत', 'बदल']
kandi_word = ['हंडा', 'भांडे', 'अक्का', 'गाजर', 'भाकरी', 'अण्णा', 'पिशवी', 'खोली', 'बांगडी', 'लवंग', 'अडकित्ता',
              'चाकरी', 'पापड', 'खलबत्ता', 'किल्ली', 'तूप', 'चिंधी', 'गुढी', 'विळी', 'आई', 'रजई', 'तंदूर', 'चिंच',
              'खोबरे', 'कणीक', 'चिमटा', 'नथ', 'तांब्या', 'उडीद', 'गाल', 'काका', 'टाळू', 'गादी', 'खिडकी', 'गच्ची',
              'बांबू', 'ताई', 'गुंडी', 'कांबळे']
gujarati_word = ['सदरा', 'दलाल', 'ढोकळा', 'घी',
                 'डबा', 'दादर', 'रिकामटेकडा', 'ईजा', 'शेट']
hindi_word = ['बच्चा', 'बात', 'भाई', 'दिल', 'दाम', 'करोड',
              'बेटा', 'मिलाप', 'तपास', 'ऑर', 'नानी', 'मंजूर', 'ईमली']
telugu_word = ['ताळा', 'अनरसा', 'किडूकमिडूक', 'क्षिकेकाई', 'बंडी', 'डबी']
tamil_word = ['चिल्ली', 'पिल्ली', 'सार', 'मठ्ठा']
#################################################################
tatsam_word = ['राजा', 'भूगोल', 'चंचू', 'पुष्प', 'परंतु', 'भगवान', 'कर', 'पशु',
               'अंध', 'जल', 'दीप', 'पृथ्वी', 'तथापि', 'कवि', 'वायु', 'भीती', 'पुत्र', 'अधापि', 'मति',
               'पुरुष', 'शिशु', 'गुरु', 'मधु', 'गंध', 'पिता', 'कन्या', 'वृक्ष', 'धर्म', 'सत्कार',
               'समर्थन', 'उत्सव', 'विद्वान', 'संत', 'निस्तेज', 'कर', 'जगन्नाथ',
               'दर्शन', 'उमेश', 'स्वामि', 'मंदिर', 'तिथी', 'सूर्य', 'स्वल्प', 'घृणा', 'पिंड', 'कलश',
               'प्रात:क', 'दंड', 'पत्र', 'ग्रंथ', 'उत्तम', 'आकाश', 'पाप', 'मंत्र', 'शिखर', 'सूत्र', 'कार्य', 'होम',
               'गणेश',
               'सभ्य', 'कन्या', 'देवर्षि', 'वृद्ध', 'संसार', 'प्रीत्यर्थ', 'कविता', 'उपकार', 'परंतु', 'गायन',
               'अश्रू', 'प्रसाद', 'अब्ज', 'राजा', 'संमती', 'घंटा', 'पुण्य', 'बुद्धी', 'अभिषेक', 'संगती', 'श्रद्धा',
               'प्रकाश',
               'सत्कार', 'देवालय', 'तारा', 'समर्थन', 'नयन', 'उत्सव', 'दुष्परिणाम', 'नैवेध', 'गुण', 'युग', 'विष',
               'प्रिय', 'मधुर', 'बहुत', 'मधुर', 'अनिल',
               'परिचित', 'स्थानिक', 'बुध', 'सुख', 'हिम', 'शिव', 'कुसुम', 'तरुण', 'रसिक', 'चतुर', 'नागरिक', 'सामाजिक',
               'पूजा', 'भीती', 'प्रीती', 'पूर्व', 'दीप', 'पीडा', 'नवीन', 'संगीत', 'लीला', 'नीती', 'कीर्ती', 'चूर्ण',
               'नीच', 'क्रीडा',
               'शरीर', 'परीक्षा']
#####################################################################################
INVARIABLE = ['परंतु', 'अध्यापि', 'तथापि', 'अति',
              'इति', 'प्रभृति', 'यध्यपि', 'नि', 'आणि']
INDECLINABLE = 'इत्यादी'
SPECIAL_WORDS = ['नागपुर', 'एखादा', 'कोणता']
######################################################################################
# CONSONANTS
VELAR_CONSONANTS = ['क', 'ख', 'ग', 'घ', 'ङ']
PALATAL_CONSONANTS = ['च', 'छ', 'ज', 'झ', 'ञ']
RETROFLEX_CONSONANTS = ['ट', 'ठ', 'ड', 'ढ', 'ण']
DENTAL_CONSONANTS = ['त', 'थ', 'द', 'ध', 'न']
LABIAL_CONSONANTS = ['प', 'फ', 'ब', 'भ', 'म']
NASAL_CONSONANTS = ['ण', 'न', 'म', 'ङ']
# semi vowels in marathi
SEMI_VOWELS = ['य् ', 'र् ', 'ल् ', 'व् ']
# virama consonants
VIRAMA_CONSONANTS = ['य् ', 'र् ', 'ल् ', 'व् ', 'श् ', 'ष् ', 'स् ', 'ह् ']
# Sudh consonants
SHUDH_CONSONANTS = ['य', 'र', 'ल', 'व', 'श', 'ष', 'स', 'ह']
# sibilants in marathi
SIBILANTS = ['श', 'ष', 'स']
# fricative consonant in marathi
FRIACTIVE_CONSONANTS = ['ह']
# additional consonants:
ADDITIONAL_CONSONANTS = ['ळ', 'क्ष', 'ज्ञ']

# virama
VIRAMA = '्'

CONSONANTS = ['क', 'ख', 'ग', 'घ', 'ङ', 'च', 'छ', 'ज', 'झ', 'ञ', 'ट', 'ठ', 'ड', 'ढ', 'ण', 'त', 'थ', 'द', 'ध', 'न', 'प',
              'फ', 'ब', 'भ', 'म', 'य', 'र', 'ल', 'व', 'श', 'ष', 'स', 'ह', 'ळ', 'क्ष', 'ज्ञ']

######################################################################################
# VOWELS
STD_VOWELS = ['अ', 'आ', 'इ', 'ई', 'उ', 'ऊ', 'ए', 'ऐ',
              'ओ', 'औ', 'ऋ', 'ॠ', 'ऌ', 'ॡ', 'अं', 'अः', 'अँ', 'ऽ']
DEV_VOWELS = ['ा', 'ॅ', 'ॉ', 'ि', 'ी', 'ु', 'ू', 'ॆ', 'े',
              'ै', 'ॊ', 'ो', 'ौ', 'ृ', 'ॄ', 'ॢ', 'ॣ', 'ं', 'ः', '्']

######################################################################################
E = ['ई', 'ि', 'ी', 'ॆ', 'े', 'ै']
U = ['उ', 'ऊ', 'ु', 'ू']
O = ['ॊ', 'ो']

######################################################################################
E_RASVA = 'इ'
E_DIRGHA = 'ई'
EE_RASVA = 'ि'
EE_DIRGHA = 'ी'

U_RASVA = 'उ'
U_DIRGHA = 'ऊ'
UU_RASVA = 'ु'
UU_DIRGHA = 'ू'

ALL_RASVA = ['इ', 'ि', 'उ', 'ु']

DIRGHA = ['ई', 'ी', 'ऊ', 'ू', 'आ', 'ा', 'े', 'ै', 'ॊ', 'ो', 'ौ', 'ओ', 'औ', 'ा', 'ॅ', 'ी', 'ॉ', 'ू', 'ॆ', 'े', 'ै', 'ॊ',
          'ो', 'ौ']

ALL_RD = ['इ', 'ि', 'उ', 'ु', 'ई', 'ी', 'ऊ', 'ू']
######################################################################
# CONJUNCTIONS
Conjuctions = ['भर', 'विरुद्ध', 'वीण', 'उलटे', 'उलट', 'प्रत', 'प्रति', 'कडे', 'लागी', 'बद्दल', 'ऐवजी', 'जागी', 'बदली',
               'पैकी', 'पोटी', 'आतून',
               'बरोबर', 'सह', 'संगे', 'सकट', 'सहित', 'रावे', 'निशी', 'समवेत', 'विषयी', 'विशी',
               'विषयी', 'सुद्धा', 'देखील', 'ही', 'पण', 'बारीक', 'केवळ', 'फक्त', 'मात्र', 'ना',
               'पण', 'फक्त', 'केवळ', 'योग्य', 'सारखा', 'समान', 'सम', 'सयान', 'प्रमाणे',
               'बरहुकूम', 'पेक्षा', 'तर', "तम", "मध्ये", 'परीस', 'शिवाय', 'खेरीज', 'विना', "वाचून",
               'व्यक्तिरिक्त', 'परता', 'साठी', "कारणे", 'करिता', 'अथा', 'प्रीत्यर्थ', 'निमित्त', 'स्तव', 'मुळे',
               'योगे', "करून", 'कडून', 'व्दारा', 'करवी', 'हाती', 'आत', 'बाहेर', 'मागे', 'पुढे', 'मध्ये',
               'अलीकडे', 'समोर', 'जवळ', 'ठायी', 'पाशी', 'नजीक', 'पूर्वी', 'पुढे', 'आधी', 'नंतर', 'पर्यंत',
               'पावेतो', 'गतिवाचक', 'आतून', 'खालून', 'मधून', 'पर्यंत', 'पासून', 'ला', 'चे', 'ने']

############################################################################
# Verbal prepositions
VP = ['पूर्वी', 'पुढे', 'आधी', 'नंतर', 'पर्यंत', 'पावेतो',
      'गतिवाचक', 'आतून', 'खालून', 'मधून', 'पर्यंत',
      'पासून', 'आत', 'बाहेर', 'मागे', 'पुढे', 'मध्ये',
      'अलीकडे', 'समोर', 'जवळ', 'ठायी', 'पाशी',
      'नजीक', 'मुळे', 'योगे', 'करून', 'कडून',
      'व्दारा', 'करवी', 'हाती', 'साठी', 'कारणे',
      'करिता', 'अथा', 'प्रीत्यर्थ', 'निमित्त', 'स्तव',
      'शिवाय', 'खेरीज', 'विना', 'वाचून', 'व्यक्तिरिक्त', 'परता', 'पेक्षा', 'तर', 'तम', 'मध्ये', 'परीस', 'योग्य', 'सारखा', 'समान',
      'सम', 'सयान', 'प्रमाणे', 'बरहुकूम', 'मात्र', 'ना', 'पण', 'फक्त', 'केवळ',
      'सुद्धा', 'देखील', 'ही', 'पण', 'बारीक', 'केवळ', 'फक्त',
      'विषयी', 'विशी', 'विषयी', 'बरोबर', 'सह', 'संगे', 'सकट', 'सहित', 'रावे', 'निशी', 'समवेत',
      'पैकी', 'पोटी', 'आतून', 'बद्दल', 'ऐवजी', 'जागी', 'बदली', 'प्रत', 'प्रति', 'कडे', 'लागी',
      'विरुद्ध', 'वीण', 'उलटे', 'उलट', 'भर']


#################################################################################
# Inflectional suffix
IS = ['स', 'ला', 'ते', 'ना', 'चा', 'ची', 'चे',
      'च्या', 'ने', 'ऐ', 'शी', 'ही', 'ऊन', 'हून', 'त', 'ई', 'आ', 'नो']


